app/views/registrations/admin_verify_user.html.erb

SELECT `authentications`.* FROM `authentications` WHERE (`authentications`.user_id = 38)
---

  <% f.authentications.each do |a| %>