app/views/registrations/show.html.erb


<h2>Following - (<%= @user.friendships.count %>)</h2>
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `friendships` WHERE (`friendships`.user_id = 18)) AS subquery
SELECT `friendships`.* FROM `friendships` WHERE (`friendships`.user_id = 15)