app/controllers/authentications_controller.rb

  def create
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])

    if authentication
      flash[:notice] = "Signed in successfully."
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      current_user.apply_omniauth(omniauth)
      current_user.save
---
SELECT `authentications`.* FROM `authentications` WHERE (`authentications`.`uid` = '19611362') AND (`authentications`.`provider` = 'twitter') LIMIT 1
INSERT INTO `users` (`account_type`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `firstname`, `image_remote_url`, `last_sign_in_at`, `last_sign_in_ip`, `lastname`, `password_salt`, `phone`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `remember_created_at`, `remember_token`, `reset_password_token`, `sign_in_count`, `updated_at`, `user_type_apply`) VALUES (NULL, '2011-10-16 06:16:28', NULL, NULL, NULL, '', 'benhall212134', 'http://a2.twimg.com/profile_images/1537705663/IMG_138340.jpg', NULL, NULL, NULL, '', NULL, 'image/jpeg', 'IMG_138340.jpg', 239735, '2011-10-16 06:16:28', NULL, NULL, NULL, 0, '2011-10-16 06:16:28', NULL)
UPDATE `users` SET `current_sign_in_at` = '2011-10-15 06:45:43', `current_sign_in_ip` = '127.0.0.1', `last_sign_in_at` = '2011-10-15 06:45:43', `last_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2011-10-15 06:45:43' WHERE (`users`.`id` = 1)