app/controllers/friendships_controller.rb

INSERT INTO `friendships` (`created_at`, `friend_id`, `updated_at`, `user_id`) VALUES ('2011-10-15 23:11:39', 18, '2011-10-15 23:11:39', 19)
---
  def create
  	  puts 'create'
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save

SELECT `friendships`.* FROM `friendships` WHERE ((user_id = 18 AND friend_id = 19) or (user_id = (19) AND friend_id = (18)))
SELECT `friendships`.* FROM `friendships` WHERE (`friendships`.user_id = 19) AND (`friendships`.`id` = 1) LIMIT 1
DELETE FROM `friendships` WHERE (`friendships`.`id` = 1)
---
  def destroy

    if params[:friend_id]
      @ff = current_user.friendships.find_by_friend_id(params[:friend_id])
    else
      @ff = Friendship.find(params[:id])
    end

    if @ff.user_id == current_user.id
      fid = @ff.friend_id
      cid = @ff.user_id
    elsif @ff.friend_id == current_user.id
      fid = @ff.user_id
      cid = @ff.friend_id
    else
      flash[:notice] = "You do not have sufficient privileges."
      redirect_to show_user_path(current_user.id)
    end

    @friendship = Friendship.find(:first, :conditions => ['(user_id = ? AND friend_id = ?)', cid, fid])
    @friendship2 = Friendship.find(:first, :conditions => ['(user_id = ? AND friend_id = ?)', fid, cid])

    @friendship.destroy if !@friendship.nil?