app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY created_at desc LIMIT 10
SELECT `users`.* FROM `users` WHERE (account_type LIKE 'company') ORDER BY created_at desc
---
  def index
    @posts = Post.find(:all, :order => 'created_at desc', :limit => 2)

    @posts.map do |a|
    	    icons = a.content.match(/\<img.*\/\>/).to_s.gsub(/\/content_/, '/large_icon_').gsub(/style=".*"/, '')
    	    a.content = a.content.gsub(/\<img.*\/\>/,'')
    	    a.content = html_truncate(a.content, 200)
    	    a.icon = icons
    end

    @companies = User.find(:all, :conditions => ['account_type LIKE ?', 'company'], :order => 'created_at desc')

SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1
---
  def show
    @post = Post.find(params[:id])

SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`content`, `created_at`, `icon`, `title`, `updated_at`, `user_id`) VALUES ('<p style=\"text-align: center; \">\r\n	<img alt=\"\" src=\"/ckeditor_assets/pictures/9/content_bayleeandpaytonhawaii.jpg?1318793675\" style=\"width: 267px; height: 200px; \" /></p>\r\n<p style=\"text-align: left; \">\r\n	1.)&nbsp;Hawaii was awesome!!! I want to go back NOW NOW NOW NOW NOW. I really relly like Hawaii!!! &nbsp;Hawaii was awesome!!! I want to go back NOW NOW NOW NOW NOW. I really relly like Hawaii!!!&nbsp;Hawaii was awesome!!! I want to go back NOW NOW NOW NOW NOW. I really relly like Hawaii!!! &nbsp;Hawaii was awesome!!! I want to go back NOW NOW NOW NOW NOW. I really relly like Hawaii!!!</p>\r\n<p style=\"text-align: center; \">\r\n	Ben Hall</p>\r\n', '2011-10-16 19:35:05', NULL, 'Hawaii', '2011-10-16 19:35:05', 39)
---
  def create
    @post = Post.new(params[:post])
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save

SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1
UPDATE `posts` SET `content` = '<p>\r\n	<img alt=\"\" src=\"/ckeditor_assets/pictures/2/content_be_awesome_today.jpg?1318699206\" style=\"width: 240px; height: 300px; \" />&nbsp;this is cool</p>\r\n', `updated_at` = '2011-10-15 17:25:47' WHERE (`posts`.`id` = 1)
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT `users`.* FROM `users` WHERE (email LIKE '%a%' or firstname like '%a%' or lastname like '%a%')
---
  def main_search
    @search = User.search(params[:search], params[:type]) #.order(sort_column + " " + sort_direction).paginate(:per_page => 5, :page => params[:page])