app/controllers/registrations_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1

  def update_verify_user
    current_user.update_attributes( :name => params[:user][:name], :phone => params[:user][:phone], :email => params[:user][:email], :user_type_apply => params[:user][:user_type_apply])
---
UPDATE `users` SET `email` = 'benhall2121@yahoo.com', `phone` = '4567', `photo_content_type` = NULL, `photo_file_name` = NULL, `photo_file_size` = NULL, `photo_updated_at` = NULL, `updated_at` = '2011-10-16 08:10:05', `user_type_apply` = 'investor' WHERE (`users`.`id` = 39)

  def admin_verify_user
    @user = User.find(:all, :conditions => ['account_type is ? or account_type = ?', nil,''])
---
SELECT `users`.* FROM `users` WHERE (account_type is 'NULL' or account_type = '')

  def admin_update_verify_user

    @user = User.find(params[:id])
    @user.update_attributes(:account_type => params[:account_type])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 39) LIMIT 1
UPDATE `users` SET `account_type` = 'Athlete', `photo_content_type` = NULL, `photo_file_name` = NULL, `photo_file_size` = NULL, `photo_updated_at` = NULL, `updated_at` = '2011-10-16 07:35:30' WHERE (`users`.`id` = 40)